92c92
< port 8000
---
> port 6379
145c145
< # tls-cert-file redis.crt
---
> # tls-cert-file redis.crt 
162,164c162
< # If "no" is specified, client certificates are not required and not accepted.
< # If "optional" is specified, client certificates are accepted and must be
< # valid if provided, but are not required.
---
> # It is possible to disable authentication using this directive.
167d164
< # tls-auth-clients optional
205,220d201
< # By default, TLS session caching is enabled to allow faster and less expensive
< # reconnections by clients that support it. Use the following directive to disable
< # caching.
< #
< # tls-session-caching no
< 
< # Change the default number of TLS sessions cached. A zero value sets the cache
< # to unlimited size. The default size is 20480.
< #
< # tls-session-cache-size 5000
< 
< # Change the default timeout of cached TLS sessions. The default timeout is 300
< # seconds.
< #
< # tls-session-cache-timeout 60
< 
225c206
< daemonize yes
---
> daemonize no
247c228
< pidfile "/var/run/redis_6379.pid"
---
> pidfile /var/run/redis_6379.pid
342c323
< dbfilename "dump.rdb"
---
> dbfilename dump.rdb
365c346
< dir "/home/jinsu/redis"
---
> dir ./
766,768c747,750
< # with ACLs. The ACL Log is useful to troubleshoot failed commands blocked
< # by ACLs. The ACL Log is stored in memory. You can reclaim memory with
< # ACL LOG RESET. Define the maximum entry length of the ACL Log below.
---
> # with ACLs. The ACL Log is useful to troubleshoot failed commands blocked 
> # by ACLs. The ACL Log is stored in and consumes memory. There is no limit
> # to its length.You can reclaim memory with ACL LOG RESET or set a maximum
> # length below.
827,831d808
< # IMPORTANT: When Redis Cluster is used, the max number of connections is also
< # shared with the cluster bus: every node in the cluster will use two
< # connections, one incoming and another outgoing. It is important to size the
< # limit accordingly in case of very large clusters.
< #
1299c1276
< # the cluster is in a down state, as long as it believes it owns the slots.
---
> # the cluster is in a down state, as long as it believes it owns the slots. 
1301c1278
< # This is useful for two cases.  The first case is for when an application
---
> # This is useful for two cases.  The first case is for when an application 
1304c1281
< # should be able to serve it.
---
> # should be able to serve it. 
1306,1307c1283,1284
< # The second use case is for configurations that don't meet the recommended
< # three shards but want to enable cluster mode and scale later. A
---
> # The second use case is for configurations that don't meet the recommended  
> # three shards but want to enable cluster mode and scale later. A 
1310c1287
< # Without a quorum of masters, slot ownership will not change automatically.
---
> # Without a quorum of masters, slot ownership will not change automatically. 
1574c1551
< stream-node-max-bytes 4kb
---
> stream-node-max-bytes 4096
1836d1812
< # Generated by CONFIG REWRITE
